Element(s) need a workplane to be moved in. There's no workplane defined in this view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotMoveElementWithoutWorkplane { get; }
  Visual Basic
Public Shared ReadOnly Property CannotMoveElementWithoutWorkplane As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotMoveElementWithoutWorkplane {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace